{
  "Name": "The name of the language.",

  "MustCombine": "Tells the user the number of elements they must combine.",
  "MaxCombine": "Tells the user the most elements they can combine.",
  "DoesntExist": "Tells the user that a single element doesn't exist.",
  "DoesntExistMultiple": "Tells the user that multiple elements don't exist.",
  "DoesntExistJoiner": "The word that joins the don't have message, like in \"a, b, and c\" this would be \"and\".",
  "DontHave": "Tells the user they don't have a single element.",
  "DontHaveMultiple": "Tells the user they don't have a set of elements.",
  "DontHaveJoiner": "The word that joins the don't have message, like in \"a, b, or c\" this would be \"or\".",
  "YouMade": "Tells the user they made an element.",
  "YouHave": "The the user they made an element, but they already have it.",
  "ComboNoExist": "Tells the user the combo doesn't exist and they can suggest a result.",

  "NewsChannel": "Tell the user the news channel was updated.",
  "VotingChannel": "Tell the user the voting channel was updated.",
  "VoteCount": "Tell the user the vote count was updated.",
  "PollCount": "Tell the user the poll count was updated.",
  "ModRole": "Tell the user the moderator role was updated.",
  "UserColorReset": "Tell the user their color was reset.",
  "HexMustBe6": "Tell the user that a hex color must be 6 characters.",
  "UserColor": "Tell the user their color was updated.",
  "Language": "Tell the user the server language was set.",
  "PlayChannelNew": "Tell the user a channel was marked as a play channel",
  "PlayChannelRemove": "Tell the user a channel was marked as not being a play channel",

  "CatNameBlank": "Tell the user the category name can't be blank.",
  "CatNameTooLong": "Tell the user the category name is too long.",
  "CatNoExist": "Tell the user the category doesn't exist.",
  "NotInCat": "Tell the user the element isn't in the category.",
  "Categorized": "Tell the user the elements were categorized.",
  "SuggestCategorized": "Tell the user the element was suggested to be categorized.",
  "SuggestCategorizedMult": "Tell the user the elements were suggested to be categorized.",
  "CategorizeMultSuggestCategorized": "Tell the user the elements were categorized and one was suggested to be categorized.",
  "CategorizeMultSuggestCategorizedMult": "Tell the user the elements were categorized and were suggested to be categorized.",

  "Uncategorized": "Tell the user the elements were un-categorized.",
  "SuggestUnCategorized": "Tell the user the element was suggested to be un-categorized.",
  "SuggestUnCategorizedMult": "Tell the user the elements were suggested to be un-categorized.",
  "UnCategorizeMultSuggestUnCategorized": "Tell the user the elements were un-categorized and one was suggested to be un-categorized.",
  "UnCategorizeMultSuggestUnCategorizedMult": "Tell the user the elements were un-categorized and were suggested to be un-categorized.",

  "Stats": "The stats message.",
  "ViewMoreStats": "The message in the View More Stats button.",
  
  "ElemCats": "The title of the /get categories embed.",
  "NameDownloadedCat": "Tell the user which category they downloaded.",
  "CatSentToDMs": "Tell the user that the category was sent to their DMs.",
  "InvalidSort": "Tell the user the chosen sort is not valid in the current context.",
  "AllCats": "The title of the embed shown when listing all categories using /cat without a specified category."
}
