{
  "Name": "The name of the language.",

  "MustCombine": "Tells the user the number of elements they must combine.",
  "MaxCombine": "Tells the user the most elements they can combine.",
  "DoesntExist": "Tells the user that a single element doesn't exist.",
  "DoesntExistMultiple": "Tells the user that multiple elements don't exist.",
  "DoesntExistJoiner": "The word that joins the don't have message, like in \"a, b, and c\" this would be \"and\".",
  "DontHave": "Tells the user they don't have a single element.",
  "DontHaveMultiple": "Tells the user they don't have a set of elements.",
  "DontHaveJoiner": "The word that joins the don't have message, like in \"a, b, or c\" this would be \"or\".",
  "YouMade": "Tells the user they made an element.",
  "YouHave": "The the user they made an element, but they already have it.",
  "ComboNoExist": "Tells the user the combo doesn't exist and they can suggest a result.",

  "NewsChannel": "Tell the user the news channel was updated.",
  "VotingChannel": "Tell the user the voting channel was updated.",
  "VoteCount": "Tell the user the vote count was updated.",
  "PollCount": "Tell the user the poll count was updated.",
  "ModRole": "Tell the user the moderator role was updated.",
  "UserColorReset": "Tell the user their color was reset.",
  "HexMustBe6": "Tell the user that a hex color must be 6 characters.",
  "UserColor": "Tell the user their color was updated.",
  "Language": "Tell the user the server language was set.",
  "PlayChannelNew": "Tell the user a channel was marked as a play channel",
  "PlayChannelRemove": "Tell the user a channel was marked as not being a play channel",

  "CatNameBlank": "Tell the user the category name can't be blank.",
  "CatNameTooLong": "Tell the user the category name is too long.",
  "CatNoExist": "Tell the user the category doesn't exist.",
  "CatAlreadyExist": "Tells the user the category already exists.",
  "NotInCat": "Tell the user the element isn't in the category.",
  "Categorized": "Tell the user the elements were categorized.",
  "SuggestCategorized": "Tell the user the element was suggested to be categorized.",
  "SuggestCategorizedMult": "Tell the user the elements were suggested to be categorized.",
  "CategorizeMultSuggestCategorized": "Tell the user the elements were categorized and one was suggested to be categorized.",
  "CategorizeMultSuggestCategorizedMult": "Tell the user the elements were categorized and were suggested to be categorized.",

  "UnCategorized": "Tell the user the elements were un-categorized.",
  "SuggestUnCategorized": "Tell the user the element was suggested to be un-categorized.",
  "SuggestUnCategorizedMult": "Tell the user the elements were suggested to be un-categorized.",
  "UnCategorizeMultSuggestUnCategorized": "Tell the user the elements were un-categorized and one was suggested to be un-categorized.",
  "UnCategorizeMultSuggestUnCategorizedMult": "Tell the user the elements were un-categorized and were suggested to be un-categorized.",

  "Stats": "The stats message.",
  "ViewMoreStats": "The message in the View More Stats button.",
  
  "ElemCategories": "The title of the /get categories embed.",
  "NameDownloadedCat": "Tell the user which category they downloaded.",
  "CatSentToDMs": "Tell the user that the category was sent to their DMs.",
  "InvalidSort": "Tell the user the chosen sort is not valid in the current context.",
  "AllCategories": "The title of the embed shown when listing all categories using /cat without a specified category.",
  
    
  "NewAIIdea": "The message in the New AI Generated Idea button.",
  "FailedAIGenerate": "Tell the user the AI could not generate a combo.",
  "SuggestIdea": "Tells the user they can suggest a result for the generated combo.",
  "YourAIIdea": "Tells the user what their AI generated combo is.",
  "ElemFound": "The title of the /get found embed.",
  
  "NewHint": "The message in the New Hint button.",
  "InvHintNoElem": "Tells the user they must input an element to get an inverse hint.",
  "HintElem": "The title of the hint embed.",
  "InvHintElem": "The title of the inverse hint embed.",
  "HintCountHasElem": "The footer of the hint embed saying how many combos are in the hint and that the user has the element.",
  "HintCountNoHasElem": "The footer of the hint embed saying how many combos are in the hint and that the user does not have the element",
  "ElemSort": "The title of the element sort embed.",
  
  "InfoExpand": "The message in the Expand button.",
  "InfoCollapse": "The message in the Collapse buton.",
  "InfoAdditionalElemCats": "The message that replaces any categories past the third in the info page, telling the user how many more categories the element is in besides those three.",
  "DefaultComment": "The default element mark.",
  "StarterElemCreateTime": "The message that should be displayed as the creation time of the starter elements.",
  "InfoCommenter": "The label for the Commenter on the info page.",
  "InfoImager": "The label for the Imager on the info page.",
  "InfoColorer": "The label for the Colorer on the info page.",
  "InfoComment": "The label for the Comment on the info page.",
  "InfoCombosUsedIn": "The label for the number of combos an element is used in on the info page.",
  "InfoCombosMadeWith": "The label for the number of combos an element can be created with on the info page.",
  "InfoUsersFoundBy": "The label for the number of users who have found an element on the info page.",
  "InfoCreator": "The label for the Creator on the info page.",
  "InfoCreateTime": "The label for the Creation Time on the info page.",
  "InfoColor": "The label for the Color on the info page.",
  "InfoTreeSize": "The label for the Tree Size on the info page.",
  "InfoComplexity": "The label for the Complexity on the info page.",
  "InfoDifficulty": "The label for the Difficulty on the info page.",
  "InfoTitle": "The title of the info page, also displaying the element.",
  "InfoElemIDUserHasElem": "The element ID, and the message saying that the user has the element.",
  "InfoElemIDUserNoHasElem": "The element ID, and the message saying that the user does not have the element.",
  "InfoElemProgress": "The label for the user's progress to the element on the info page.",
  "InfoElemCats": "The label for the Categories on the info page.",
  
  "InvalidElemID": "Tells the user that the element ID they inputted is invalid.",
  "ResetUserInv": "Tells the user that the inventory of the specified user was sucessfully reset.",
  "DownloadedInvUserServer": "Tells the user whose inventory was downloaded, and what server it was downloaded from.",
  "SentInvToDMs": "Tells the user that their downloaded inventory was sent to their DMs.",
  "LbImage": "The name given to the Leaderboard Image.",
  "UserInventory": "The title of the inventory embed, displaying whose inventory it is, the number of elements they have, and the percentage of all elements that they have.",
  "LbTitleElem": "The title given to element leaderboards.",
  "NewIdea": "The message in the New Idea button.",
  "HaveNoElemsInCat": "Tells the user that they have no elements in the specified category.",
  "FailedIdea": "Tells the user that no idea could be generated with the given parameters.",
  "YourIdea": "Tells the user what their random combo is.",
  
  "NoResults": "Tells the user that no results were found for the given search parameters.",
  "ElemSearch": "The title of the Element Search embed, also displaying the number of elements found with the search.",
  "ElemNameCannotStartWithQuestionMark": "Tells the user that the suggestion cannot start with a question mark.",
  "ElemNameMaxLength": "Tells the user the maximum number of characters they can have in an element name.",
  "ElemNameForbiddenChar": "Tells the user the characters in their suggested element name that cannot be in element names.",
  "NoSuggestElemName": "Tells the user that their suggestion cannot be empty.",
  "MustSuggestInPlayChannel": "Tells the user that they can only suggest in play channels.",
  "ComboHasResult": "Tells the user that the combo they are trying to suggest a result for already has a result.",
  "SuggestedElem": "Tells the user what combo they just suggested.",
  
  "BreakdownTitle": "The title of the breakdown embed.",
  "InvBreakdownTitle": "The title of the inventory breakdown embed.",
  "GiveElem": "Tells the user they successfully gave the specified element.",
  "GiveCat": "Tells the user they successfully gave every element in the specified category.",
  "GiveAll": "Tells the user they successfully gave every element to the specified user.",

  "GraphLayoutInvalid": "Tells the user the specified graph layout is invalid.",
  "GraphTooBigForLayout": "Tells the user the graph is too big for the specified layout.",
  "GraphOutputInvalid": "Tells the user the specified output type is invalid.",
  "SentGraphToDMs": "Tells the user the graph was sent to their DMs.",
  "GraphNotRendered": "Tells the user the graph was not rendered by the bot.",
  "NameGraphElem": "Tells the user which element/category was graphed.",
  
  "SentNotationToDMs": "Tells the user the notation was sent to their DMs.",
  "NotationTooLong": "Tells the user the notation was sent as a file to their DMs due to being too long for a normal message.",
  "NameNotationElem": "Tells the user which element the notation is for.",
  "NameNotationCat": "Tells the user which category the notation is for.",
  
  "SentPathToDMs": "Tells the user the path as sent to their DMs.",
  "PathTooLong": "Tells the user the path was sent as a file to their DMs due to being too long for a normal message.",
  "NamePathElem": "Tells the user which element the path is for.",
  "NamePathCat": "Tells the user which category the path is for.",

  "NewElemPoll": "The title of polls for new elements.",
  "NewComboPoll": "The title of polls for new element combinations.",
  "PollFooter": "The footer of all polls.",
  "NewMarkPoll": "The title of polls for element marks.",
  "ElemImagePoll": "The title of polls for element images.",
  "AddCatPoll": "The title of polls for element categorizations.",
  "RmCatPoll": "The title of polls for element un-categorizations.",
  "DelCatPoll": "The title of polls for category deletions.",
  "CatImagePoll": "The title of polls for category images.",
  "ElemColorPoll": "The title of polls for element colors.",
  "ResetCatColorPoll": "The title of polls for category color resets.",
  "SetCatColorPoll": "The title of polls for category color changes.",
  "MoreElemsPoll": "The description to put when the number of elements displayed in the poll is shortened.",
  "IntersectPoll": "The title of polls for category intersections.",
  "UnionPoll": "The title of polls for category unions.",
  "DiffPoll": "The title of polls for category differences.",

  "NewNote": "The line displaying the new element mark in polls.",
  "OldNote": "The line displaying the old element mark in polls.",
  "NewImage": "The text on the link to the new image in polls.",
  "OldImage": "The text on the link to the old image in polls.",
  "CatPollElems": "The line with the title of the list of elements in categorization/decategorization polls.",
  "CatPollCat": "The line with the category in categorization/decategorization polls.",
  "ShownOnLeft": "The text denoting that the color of elements/categories is shown on the left color bar of the embed.",
  "OldColor": "The line with the old color in polls.",
  "PollCreatorText": "The line denoting the suggester of polls.",

  "Lasted": "How long the poll lasted.",
  "NewElemNews": "The news message for when a new element is created.",
  "NewComboNews": "The news message for when a new combination for an element is created.",
  "SignedElemNews": "The news message for successful element mark polls.",
  "AddedImageNews": "The news message when an element is first given an image.",
  "ChangedImageNews": "The news message when an element's image is changed.",
  "ColoredElemNews": "The news message when an element's color is changed.",
  "RejectedPollNews": "The news message when a poll is rejected.",
  "RejectedPollDM": "The DM to the user whose poll was rejected saying which server the poll was in, how many upvotes/downvotes it had, and the poll itself.",
  "AddCatNews": "The news message when a single element is added to a category.",
  "AddCatMultNews": "The news message when multiple elements are added to a category.",
  "RmCatNews": "The news message when a single element is removed from a category.",
  "RmCatMultNews": "The news message when multiple elements are removed from a category.",
  "ResetCatColorNews": "The news message when a category's color is reset.",
  "SetCatColorNews": "The news message when a category's color is changed.",

  "MaxMarkLength": "Tells the user that a creator mark must be below 2400 characters.",
  "MarkChanged": "Tells the user that they changed the mark of their element.",
  "MarkSuggested": "Tells the user that a poll was created to change the mark of the element.",
  "ImageAdded": "Tells the user that they added an image of their element.",
  "ImageChanged": "Tells the user that they changed the image of their element.",
  "ImageSuggested": "Tells the user that a poll was created to change the image of the element.",
  "ElemColorChanged": "Tells the user that they changed the color of their element.",
  "ElemColorSuggested": "Tells the user that a poll was created to change the color of the element.",
  "CatImageSuggested": "Tells the user that a poll was created to change the image of the category.",
  "CatColorSuggested": "Tells the user that a poll was created to change the color of the category.",

  "MustAttachImage": "Tell the user they must attach an image.",
  "AddCatMustHaveSeparator": "Tell the user they must separate the category name and the elements to add to the category with a vertical bar.",
  "RmCatMustHaveSeparator": "Tell the user they must separate the category name and the elements to remove from the category with a vertical bar.",
  "MarkMustHaveSeparator": "Tell the user they must separate the element name and the element mark with a vertical bar.",
  "PingMessage": "The message given by the !ping command, also displaying the latency of the bot's response.",

  "MustHaveAdmin": "Tell the user they must have the Administrator permission.",
  "MustHaveAdminOrModRole": "Tell the user they must have the Administrator permission or the server moderator role.",
  "MustHaveElemForPath": "Tell the user they must have the element to get its path.",
  "MustHaveCatForPath": "Tell the user they must have every element in the category to get its path.",

  "MustHaveElemOrID": "Tell the user that they must input either an element or an element ID.",
  "CannotHaveBothElemAndID": "Tell the user that they cannot input both an element and an element ID.",
  "IDCannotBeNegative": "Tell the user their element ID cannot be negative.",
  "DBNoCombo": "Tell the user the combo doesn't exist.",
  "PollNoExist": "Tell the user the poll doesn't exist.",
  "CalculatingPing": "Tell the user that the bot is calculating the ping.",

  "SentWordCloud": "Tell the user the word cloud was sent in their DMs.",
  "WordCloudElem": "Tell the user which element the word cloud is for.",
  "WordCloudDimensionsTooLow": "Tell the user the dimensions of the word cloud are too low.",
  "WordCloudDimensionsTooHigh": "Tell the user the dimensions of the word cloud are too high."
}
